Австралия/src/Documents/TaxAccrual/TaxAccrual.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TaxAccrual</name>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.TaxPayable</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesTaxAccrual</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>TaxKind</name>
      <type>
        <types>CatalogRef.TaxTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Correspondence</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessLine</name>
      <type>
        <types>CatalogRef.LinesOfBusiness</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>IncomeItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>RegisterIncome</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>RegisterExpense</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Enums/OperationTypesTaxAccrual/OperationTypesTaxAccrual.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesTaxAccrual</name>
  <enumValues>
    <name>Accrual</name>
  </enumValues>
  <enumValues>
    <name>Reimbursement</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/IncomeAndExpenseTypes/IncomeAndExpenseTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>IncomeAndExpenseTypes</name>
  <predefined>
    <items>
      <name>AdministrativeExpenses</name>
      <description>Administrative expenses</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>ManufacturingOverheads</name>
      <description>Manufacturing overheads</description>
    </items>
    <items>
      <name>OtherExpenses</name>
      <description>Other expenses</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>OtherIncomeExpenses</name>
      <description>Other income/expenses (allocation to income summary account)</description>
    </items>
    <items>
      <name>PurchaseReturn</name>
      <description>Purchase return</description>
    </items>
    <items>
      <name>Revenue</name>
      <description>Revenue</description>
    </items>
    <items>
      <name>SalesReturn</name>
      <description>Sales return</description>
    </items>
  </predefined>
  <attributes>
    <name>IncomeAndExpenseCategory</name>
    <type>
      <types>EnumRef.IncomeAndExpenseCategories</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/BusinessUnits/BusinessUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>MainDepartment</name>
      <description>Main department</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Main warehouse</description>
    </items>
    <items>
      <name>DropShipping</name>
      <description>Drop shipping</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.BusinessUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientOfWastes</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningInterval</name>
    <type>
      <types>EnumRef.PlanningIntervals</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningIntervalDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Documents/TaxAccrual/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Constants.UseSeveralDepartments.Get() Then
		
		For Each RowTaxes In Taxes Do
			
			If RowTaxes.ExpenseItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.ManufacturingOverheads
				Or RowTaxes.IncomeItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.Revenue
				Or RowTaxes.ExpenseItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.AdministrativeExpenses Then
				
				RowTaxes.Department = Catalogs.BusinessUnits.MainDepartment;
			EndIf;
			
		EndDo;
		
	EndIf;
	
	If GetFunctionalOption("UseDefaultTypeOfAccounting") And Not Constants.UseSeveralLinesOfBusiness.Get() Then
		
		For Each RowTaxes In Taxes Do
			If RowTaxes.IncomeItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.Revenue
				Or RowTaxes.ExpenseItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.AdministrativeExpenses Then
				RowTaxes.BusinessLine = Catalogs.LinesOfBusiness.MainLine;
			EndIf;
		EndDo;
			
	EndIf;
	
	DocumentAmount = Taxes.Total("Amount");
	
	// Change of approved documents
	AccountingApprovalServer.BeforeWriteAtServer(ThisObject, Cancel);
	// End Change of approved documents
	
	AdditionalProperties.Insert("WriteMode", WriteMode);
	AdditionalProperties.Insert("Posted", Posted);
	
EndProcedure

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If GetFunctionalOption("UseDefaultTypeOfAccounting") And Constants.UseSeveralDepartments.Get() Then
	
		For Each RowTaxes In Taxes Do
			
			If (RowTaxes.ExpenseItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.ManufacturingOverheads
				Or RowTaxes.IncomeItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.Revenue
				Or RowTaxes.ExpenseItem.IncomeAndExpenseType = Catalogs.IncomeAndExpenseTypes.AdministrativeExpenses)
					And Not ValueIsFilled(RowTaxes.Department) Then
			
				MessageText = StringFunctionsClientServer.SubstituteParametersToString(
					NStr("en = 'The ""Department"" attribute should be filled in for the %1 costs account specified in the %2 line of the ""Taxes"" list.'; ru = 'Для счета затрат %1 указанного в строке %2 списка ""Налоги"", должен быть заполнен реквизит ""Подразделение"".';pl = 'Dla rachunku kosztów %1 określonego w wierszu %2 listy ""Podatki"" należy wypełnić atrybut ""Dział"".';es_ES = 'El atributo ""Departamento"" tiene que estar rellenado para la cuenta de costes %1 especificada en la línea %2 de la lista ""Impuestos"".';es_CO = 'El atributo ""Departamento"" tiene que estar rellenado para la cuenta de costes %1 especificada en la línea %2 de la lista ""Impuestos"".';tr = '""Vergiler"" listesinin %2 satırında belirtilen ""%1"" maliyet hesabı için ""Bölüm"" özniteliği doldurulmalı.';it = 'L''attributo ""Reparto"" dovrebbe essere compilato il costo %1 specificato nella linea %2 dell''elenco ""Tasse"".';de = 'Das Attribut ""Abteilung"" sollte für das in der %2 Zeile der Liste ""Steuern"" angegebene %1 Kostenkonto ausgefüllt werden.'"),
					RowTaxes.Correspondence,
					RowTaxes.LineNumber);
					
				DriveServer.ShowMessageAboutError(
					ThisObject,
					MessageText,
					"Taxes",
					RowTaxes.LineNumber,
					"Department",
					Cancel);
				
			EndIf;
			
		EndDo;
	
	EndIf;
	
	IsAccrual = OperationKind = Enums.OperationTypesTaxAccrual.Accrual;
	
	For Each RowTaxes In Taxes Do
		
		If IsAccrual Then
			If RowTaxes.RegisterExpense And Not ValueIsFilled(RowTaxes.ExpenseItem) Then
				DriveServer.ShowMessageAboutError(
					ThisObject,
					StringFunctionsClientServer.SubstituteParametersToString(
						NStr("en = 'On the Taxes tab, in line #%1, an expense item is required.'; ru = 'На вкладке ""Налоги"" в строке %1 требуется указать статью расходов.';pl = 'Na karcie Podatki, w wierszu nr %1, pozycja rozchodów jest wymagana.';es_ES = 'En la pestaña Impuestos, en la línea #%1, se requiere un artículo de gastos.';es_CO = 'En la pestaña Impuestos, en la línea #%1, se requiere un artículo de gastos.';tr = 'Vergiler sekmesinin %1 nolu satırında gider kalemi gerekli.';it = 'Nella scheda Imposte, nella riga #%1, è richiesta una voce di uscita.';de = 'Eine Position von Ausgaben ist in der Zeile Nr. %1 auf der Registerkarte Steuern erforderlich.'"),
						RowTaxes.LineNumber),
					"Taxes",
					RowTaxes.LineNumber,
					"ExpenseItem",
					Cancel);
			EndIf;
		Else
			If RowTaxes.RegisterIncome And Not ValueIsFilled(RowTaxes.IncomeItem) Then
				DriveServer.ShowMessageAboutError(
					ThisObject,
					StringFunctionsClientServer.SubstituteParametersToString(
						NStr("en = 'On the Taxes tab, in line #%1, an income item is required.'; ru = 'На вкладке ""Налоги"" в строке %1 требуется указать статью доходов.';pl = 'Na karcie Podatki, w wierszu nr %1, pozycja dochodów jest wymagana.';es_ES = 'En la pestaña Impuestos, en la línea #%1, se requiere un artículo de ingresos.';es_CO = 'En la pestaña Impuestos, en la línea #%1, se requiere un artículo de ingresos.';tr = 'Vergiler sekmesinin %1 nolu satırında gelir kalemi gerekli.';it = 'Nella scheda Imposte, nella riga #%1, è richiesta una voce di entrata.';de = 'Eine Position von Einnahme ist in der Zeile Nr. %1 auf der Registerkarte Steuern erforderlich.'"),
						RowTaxes.LineNumber),
					"Taxes",
					RowTaxes.LineNumber,
					"IncomeItem",
					Cancel);
			EndIf;
		EndIf;
		
	EndDo;
	
	If Not WorkWithVATServerCall.CompanyIsRegisteredForVAT(Company, Date) Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "CompanyVATNumber");
	EndIf;
	
EndProcedure

// Procedure - event handler Posting(). Creates
// a document movement by accumulation registers and accounting register.
//
// 1. Delete the existing document transactions.
// 2. Generation document header structure with
// fields used in document post algorithms.
// 3. header value filling check and tabular document sections.
// 4. Creation temporary table by document which
// is necessary for transaction generating.
// 5. Creating the document records in accumulation register.
// 6. Creating the document records in accounting register.
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting.
	DriveServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Accounting templates properties initialization.
	AccountingTemplatesPosting.InitializeAccountingTemplatesProperties(Ref, AdditionalProperties, Cancel);
	If AdditionalProperties.ForPosting.AccountingTemplatesPostingUnavailable Then
		Return;
	EndIf;
	
	// Document data initialization.
	Documents.TaxAccrual.InitializeDocumentData(Ref, AdditionalProperties);
	
	AccountingTemplatesPosting.CheckEntriesAccounts(AdditionalProperties, Cancel);
	
	// Preparation of records sets.
	DriveServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Account for in accounting sections.
	DriveServer.ReflectTaxesSettlements(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectIncomeAndExpenses(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectInventory(AdditionalProperties, RegisterRecords, Cancel);
	
	// Accounting
	DriveServer.ReflectAccountingJournalEntries(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAccountingJournalEntriesSimple(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAccountingJournalEntriesCompound(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAccountingEntriesData(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectDocumentAccountingEntriesStatuses(ThisObject, AdditionalProperties, RegisterRecords, Cancel);
	
	// Record of the records sets.
	DriveServer.WriteRecordSets(ThisObject);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
	AccountingTemplatesPosting.CheckForDuplicateAccountingEntries(Ref, Company, Date, Cancel);
	
	// Subordinate documents
	If Not Cancel Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, DocumentWriteMode.Posting, DeletionMark, Company, Date, AdditionalProperties);
		
	EndIf;
	
EndProcedure

// Procedure - event handler UndoPosting object.
//
Procedure UndoPosting(Cancel)
	
	// Initialization of additional properties to undo document posting
	DriveServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Preparation of record sets
	DriveServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Writing of record sets
	DriveServer.WriteRecordSets(ThisObject);
	
	AccountingTemplatesPosting.CheckForDuplicateAccountingEntries(Ref, Company, Date, Cancel);
	
	// Subordinate documents
	If Not Cancel Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, DocumentWriteMode.UndoPosting, DeletionMark, Company, Date, AdditionalProperties);
			
		DriveServer.ReflectDeletionAccountingTransactionDocuments(Ref);
		
	EndIf;
		
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	DriveServer.CheckDocumentsReposting(Ref, AdditionalProperties.Posted, Cancel);
	
	If Not Cancel And AdditionalProperties.WriteMode = DocumentWriteMode.Write Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, AdditionalProperties.WriteMode, DeletionMark, Company, Date, AdditionalProperties);
		
	EndIf;
		
EndProcedure

#EndRegion

#EndIf
